#!/bin/bash
# add questions
http POST localhost:5000/question question="ನೀವು ಎಲ್ಲಿ ವಾಸ ಮಾಡುತ್ತಿದ್ದೀರಾ?" bound=5
http POST localhost:5000/question question="ನಿಮ್ಮ ಮನೆಯಲ್ಲಿ ಯಾರೆಲ್ಲ  ಇದ್ದಾರೆ?" bound=5
http POST localhost:5000/question question="ನೀವು ಏನು ಓದುತ್ತಿದ್ದೀರಾ ಕೆಲಸ ಮಾಡುತ್ತಿದ್ದೀರಾ?" bound=5
# add passages
http POST localhost:5000/passage passage="ಬೆಂಗಳೂರು ನಮ್ಮ ರಾಜ್ಯದ ಒಂದು ದೊಡ್ಡ ಊರು. ಈ ಊರನ್ನು ನಮ್ಮ ರಾಜ್ಯದ \"ಬೊಂಬಾಯಿ\" ಎನ್ನುವರು. ಇಂಡಿಯಾದ ದೊಡ್ಡ ನಗರಗಳಲ್ಲಿ ಇದು ಒಂದು. ಈ ಊರನ್ನು ನೋಡಲು ಜನರು ಬೇರೆ ಬೇರೆ ಊರುಗಳಿಂದ ಬರುವರು. ಇದಲ್ಲದೆ ನಮ್ಮ ರಾಜ್ಯದಲ್ಲಿರುವ ಬೇಲೂರು, ಜೋಗ್, ನಂದಿ ಇವುಗಳನ್ನು ನೋಡಲು ಜನರು ಬರುವರು. ಈ ನಾಡಿನಲ್ಲಿ ರೇಷ್ಮೆಯನ್ನು ಬೆಳೆಯುವರು" bound=15
http POST localhost:5000/passage passage="ಕೃಷ್ಣಾ ನದಿಯು ಸಹ್ಯಾದ್ರಿ ಪರ್ವತಗಳ್ಲಲಿ ಮಹಾಬಲೇಶ್ವರದ ಹತ್ತಿರ ಹುಟ್ಟುತ್ತದೆ.ಈ ಪ್ರದೇಶವು ರಮಣೀಯವಾದ ಸ್ಥಾನ. ಇದು ಮಹಾರಾಷ್ಟ್ರ,ಕರ್ನಾಟಕ ಮತ್ತು ಆಂಧ್ರಪ್ರದೇಶಗಳಲ್ಲಿ ಹರಿದು ಬಂಗಾಳ ಕೊಲ್ಲಿಯನ್ನು ಸೇರುತ್ತದೆ. ಇದಕ್ಕೆ ಉಪನದಿಗಳು ಹಲವು ಕೊಯಿನಾ, ತುಂಗಭದ್ರಾ, ಘಟಪ್ರಭಾ,ಭೀಮ, ಮಲಪ್ರಭಾ - ಅವುಗಳಲ್ಲಿ ಕೆಲವು. ಕೊಯಿನಾ ನದಿಗೆ ಅಣೆಕಟ್ಟನ್ನು ಕಟ್ಟಿ ವಿದ್ಯುತನ್ನು ಉತ್ಪಾದನೆ ಮಾಡುತ್ತಾರೆ" bound=15

